grevaillot/svd_tools/headers/STM32F407/rcc.h
/** @defgroup rcc_apb2rstr APB2RSTR APB2 peripheral reset register
@{*/

/** RCC_APB2RSTR_TIM11RST TIM11 reset **/
#define RCC_APB2RSTR_TIM11RST		(1 << 18)
/** RCC_APB2RSTR_TIM10RST TIM10 reset **/
#define RCC_APB2RSTR_TIM10RST		(1 << 17)
/** RCC_APB2RSTR_TIM9RST TIM9 reset **/
#define RCC_APB2RSTR_TIM9RST		(1 << 16)
/** RCC_APB2RSTR_SYSCFGRST System configuration controller reset **/
#define RCC_APB2RSTR_SYSCFGRST		(1 << 14)
/** RCC_APB2RSTR_SPI1RST SPI 1 reset **/
#define RCC_APB2RSTR_SPI1RST		(1 << 12)
/** RCC_APB2RSTR_SDIORST SDIO reset **/
#define RCC_APB2RSTR_SDIORST		(1 << 11)
/** RCC_APB2RSTR_ADCRST ADC interface reset (common to all ADCs) **/
#define RCC_APB2RSTR_ADCRST		(1 << 8)
/** RCC_APB2RSTR_USART6RST USART6 reset **/
#define RCC_APB2RSTR_USART6RST		(1 << 5)
/** RCC_APB2RSTR_USART1RST USART1 reset **/
#define RCC_APB2RSTR_USART1RST		(1 << 4)
/** RCC_APB2RSTR_TIM8RST TIM8 reset **/
#define RCC_APB2RSTR_TIM8RST		(1 << 1)
/** RCC_APB2RSTR_TIM1RST TIM1 reset **/
#define RCC_APB2RSTR_TIM1RST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb1enr AHB1ENR AHB1 peripheral clock register
@{*/

/** RCC_AHB1ENR_OTGHSULPIEN USB OTG HSULPI clock enable **/
#define RCC_AHB1ENR_OTGHSULPIEN		(1 << 30)
/** RCC_AHB1ENR_OTGHSEN USB OTG HS clock enable **/
#define RCC_AHB1ENR_OTGHSEN		(1 << 29)
/** RCC_AHB1ENR_ETHMACPTPEN Ethernet PTP clock enable **/
#define RCC_AHB1ENR_ETHMACPTPEN		(1 << 28)
/** RCC_AHB1ENR_ETHMACRXEN Ethernet Reception clock enable **/
#define RCC_AHB1ENR_ETHMACRXEN		(1 << 27)
/** RCC_AHB1ENR_ETHMACTXEN Ethernet Transmission clock enable **/
#define RCC_AHB1ENR_ETHMACTXEN		(1 << 26)
/** RCC_AHB1ENR_ETHMACEN Ethernet MAC clock enable **/
#define RCC_AHB1ENR_ETHMACEN		(1 << 25)
/** RCC_AHB1ENR_DMA2EN DMA2 clock enable **/
#define RCC_AHB1ENR_DMA2EN		(1 << 22)
/** RCC_AHB1ENR_DMA1EN DMA1 clock enable **/
#define RCC_AHB1ENR_DMA1EN		(1 << 21)
/** RCC_AHB1ENR_BKPSRAMEN Backup SRAM interface clock enable **/
#define RCC_AHB1ENR_BKPSRAMEN		(1 << 18)
/** RCC_AHB1ENR_CRCEN CRC clock enable **/
#define RCC_AHB1ENR_CRCEN		(1 << 12)
/** RCC_AHB1ENR_GPIOIEN IO port I clock enable **/
#define RCC_AHB1ENR_GPIOIEN		(1 << 8)
/** RCC_AHB1ENR_GPIOHEN IO port H clock enable **/
#define RCC_AHB1ENR_GPIOHEN		(1 << 7)
/** RCC_AHB1ENR_GPIOGEN IO port G clock enable **/
#define RCC_AHB1ENR_GPIOGEN		(1 << 6)
/** RCC_AHB1ENR_GPIOFEN IO port F clock enable **/
#define RCC_AHB1ENR_GPIOFEN		(1 << 5)
/** RCC_AHB1ENR_GPIOEEN IO port E clock enable **/
#define RCC_AHB1ENR_GPIOEEN		(1 << 4)
/** RCC_AHB1ENR_GPIODEN IO port D clock enable **/
#define RCC_AHB1ENR_GPIODEN		(1 << 3)
/** RCC_AHB1ENR_GPIOCEN IO port C clock enable **/
#define RCC_AHB1ENR_GPIOCEN		(1 << 2)
/** RCC_AHB1ENR_GPIOBEN IO port B clock enable **/
#define RCC_AHB1ENR_GPIOBEN		(1 << 1)
/** RCC_AHB1ENR_GPIOAEN IO port A clock enable **/
#define RCC_AHB1ENR_GPIOAEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb2enr AHB2ENR AHB2 peripheral clock enable register
@{*/

/** RCC_AHB2ENR_OTGFSEN USB OTG FS clock enable **/
#define RCC_AHB2ENR_OTGFSEN		(1 << 7)
/** RCC_AHB2ENR_RNGEN Random number generator clock enable **/
#define RCC_AHB2ENR_RNGEN		(1 << 6)
/** RCC_AHB2ENR_DCMIEN Camera interface enable **/
#define RCC_AHB2ENR_DCMIEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb3enr AHB3ENR AHB3 peripheral clock enable register
@{*/

/** RCC_AHB3ENR_FSMCEN Flexible static memory controller module clock enable **/
#define RCC_AHB3ENR_FSMCEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1enr APB1ENR APB1 peripheral clock enable register
@{*/

/** RCC_APB1ENR_DACEN DAC interface clock enable **/
#define RCC_APB1ENR_DACEN		(1 << 29)
/** RCC_APB1ENR_PWREN Power interface clock enable **/
#define RCC_APB1ENR_PWREN		(1 << 28)
/** RCC_APB1ENR_CAN2EN CAN 2 clock enable **/
#define RCC_APB1ENR_CAN2EN		(1 << 26)
/** RCC_APB1ENR_CAN1EN CAN 1 clock enable **/
#define RCC_APB1ENR_CAN1EN		(1 << 25)
/** RCC_APB1ENR_I2C3EN I2C3 clock enable **/
#define RCC_APB1ENR_I2C3EN		(1 << 23)
/** RCC_APB1ENR_I2C2EN I2C2 clock enable **/
#define RCC_APB1ENR_I2C2EN		(1 << 22)
/** RCC_APB1ENR_I2C1EN I2C1 clock enable **/
#define RCC_APB1ENR_I2C1EN		(1 << 21)
/** RCC_APB1ENR_UART5EN UART5 clock enable **/
#define RCC_APB1ENR_UART5EN		(1 << 20)
/** RCC_APB1ENR_UART4EN UART4 clock enable **/
#define RCC_APB1ENR_UART4EN		(1 << 19)
/** RCC_APB1ENR_USART3EN USART3 clock enable **/
#define RCC_APB1ENR_USART3EN		(1 << 18)
/** RCC_APB1ENR_USART2EN USART 2 clock enable **/
#define RCC_APB1ENR_USART2EN		(1 << 17)
/** RCC_APB1ENR_SPI3EN SPI3 clock enable **/
#define RCC_APB1ENR_SPI3EN		(1 << 15)
/** RCC_APB1ENR_SPI2EN SPI2 clock enable **/
#define RCC_APB1ENR_SPI2EN		(1 << 14)
/** RCC_APB1ENR_WWDGEN Window watchdog clock enable **/
#define RCC_APB1ENR_WWDGEN		(1 << 11)
/** RCC_APB1ENR_TIM14EN TIM14 clock enable **/
#define RCC_APB1ENR_TIM14EN		(1 << 8)
/** RCC_APB1ENR_TIM13EN TIM13 clock enable **/
#define RCC_APB1ENR_TIM13EN		(1 << 7)
/** RCC_APB1ENR_TIM12EN TIM12 clock enable **/
#define RCC_APB1ENR_TIM12EN		(1 << 6)
/** RCC_APB1ENR_TIM7EN TIM7 clock enable **/
#define RCC_APB1ENR_TIM7EN		(1 << 5)
/** RCC_APB1ENR_TIM6EN TIM6 clock enable **/
#define RCC_APB1ENR_TIM6EN		(1 << 4)
/** RCC_APB1ENR_TIM5EN TIM5 clock enable **/
#define RCC_APB1ENR_TIM5EN		(1 << 3)
/** RCC_APB1ENR_TIM4EN TIM4 clock enable **/
#define RCC_APB1ENR_TIM4EN		(1 << 2)
/** RCC_APB1ENR_TIM3EN TIM3 clock enable **/
#define RCC_APB1ENR_TIM3EN		(1 << 1)
/** RCC_APB1ENR_TIM2EN TIM2 clock enable **/
#define RCC_APB1ENR_TIM2EN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2enr APB2ENR APB2 peripheral clock enable register
@{*/

/** RCC_APB2ENR_TIM11EN TIM11 clock enable **/
#define RCC_APB2ENR_TIM11EN		(1 << 18)
/** RCC_APB2ENR_TIM10EN TIM10 clock enable **/
#define RCC_APB2ENR_TIM10EN		(1 << 17)
/** RCC_APB2ENR_TIM9EN TIM9 clock enable **/
#define RCC_APB2ENR_TIM9EN		(1 << 16)
/** RCC_APB2ENR_SYSCFGEN System configuration controller clock enable **/
#define RCC_APB2ENR_SYSCFGEN		(1 << 14)
/** RCC_APB2ENR_SPI1EN SPI1 clock enable **/
#define RCC_APB2ENR_SPI1EN		(1 << 12)
/** RCC_APB2ENR_SDIOEN SDIO clock enable **/
#define RCC_APB2ENR_SDIOEN		(1 << 11)
/** RCC_APB2ENR_ADC3EN ADC3 clock enable **/
#define RCC_APB2ENR_ADC3EN		(1 << 10)
/** RCC_APB2ENR_ADC2EN ADC2 clock enable **/
#define RCC_APB2ENR_ADC2EN		(1 << 9)
/** RCC_APB2ENR_ADC1EN ADC1 clock enable **/
#define RCC_APB2ENR_ADC1EN		(1 << 8)
/** RCC_APB2ENR_USART6EN USART6 clock enable **/
#define RCC_APB2ENR_USART6EN		(1 << 5)
/** RCC_APB2ENR_USART1EN USART1 clock enable **/
#define RCC_APB2ENR_USART1EN		(1 << 4)
/** RCC_APB2ENR_TIM8EN TIM8 clock enable **/
#define RCC_APB2ENR_TIM8EN		(1 << 1)
/** RCC_APB2ENR_TIM1EN TIM1 clock enable **/
#define RCC_APB2ENR_TIM1EN		(1 << 0)

/**@}*/

