grevaillot/svd_tools/headers/STM32F407/rcc.h
/** @defgroup rcc_apb2lpenr APB2LPENR APB2 peripheral clock enabled in low power mode register
@{*/

/** RCC_APB2LPENR_TIM11LPEN TIM11 clock enable during Sleep mode **/
#define RCC_APB2LPENR_TIM11LPEN		(1 << 18)
/** RCC_APB2LPENR_TIM10LPEN TIM10 clock enable during Sleep mode **/
#define RCC_APB2LPENR_TIM10LPEN		(1 << 17)
/** RCC_APB2LPENR_TIM9LPEN TIM9 clock enable during sleep mode **/
#define RCC_APB2LPENR_TIM9LPEN		(1 << 16)
/** RCC_APB2LPENR_SYSCFGLPEN System configuration controller clock enable during Sleep mode **/
#define RCC_APB2LPENR_SYSCFGLPEN		(1 << 14)
/** RCC_APB2LPENR_SPI1LPEN SPI 1 clock enable during Sleep mode **/
#define RCC_APB2LPENR_SPI1LPEN		(1 << 12)
/** RCC_APB2LPENR_SDIOLPEN SDIO clock enable during Sleep mode **/
#define RCC_APB2LPENR_SDIOLPEN		(1 << 11)
/** RCC_APB2LPENR_ADC3LPEN ADC 3 clock enable during Sleep mode **/
#define RCC_APB2LPENR_ADC3LPEN		(1 << 10)
/** RCC_APB2LPENR_ADC2LPEN ADC2 clock enable during Sleep mode **/
#define RCC_APB2LPENR_ADC2LPEN		(1 << 9)
/** RCC_APB2LPENR_ADC1LPEN ADC1 clock enable during Sleep mode **/
#define RCC_APB2LPENR_ADC1LPEN		(1 << 8)
/** RCC_APB2LPENR_USART6LPEN USART6 clock enable during Sleep mode **/
#define RCC_APB2LPENR_USART6LPEN		(1 << 5)
/** RCC_APB2LPENR_USART1LPEN USART1 clock enable during Sleep mode **/
#define RCC_APB2LPENR_USART1LPEN		(1 << 4)
/** RCC_APB2LPENR_TIM8LPEN TIM8 clock enable during Sleep mode **/
#define RCC_APB2LPENR_TIM8LPEN		(1 << 1)
/** RCC_APB2LPENR_TIM1LPEN TIM1 clock enable during Sleep mode **/
#define RCC_APB2LPENR_TIM1LPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_bdcr BDCR Backup domain control register
@{*/

/** RCC_BDCR_BDRST Backup domain software reset **/
#define RCC_BDCR_BDRST		(1 << 16)
/** RCC_BDCR_RTCEN RTC clock enable **/
#define RCC_BDCR_RTCEN		(1 << 15)
/** RCC_BDCR_RTCSEL1 RTC clock source selection **/
#define RCC_BDCR_RTCSEL1		(1 << 9)
/** RCC_BDCR_RTCSEL0 RTC clock source selection **/
#define RCC_BDCR_RTCSEL0		(1 << 8)
/** RCC_BDCR_LSEBYP External low-speed oscillator bypass **/
#define RCC_BDCR_LSEBYP		(1 << 2)
/** RCC_BDCR_LSERDY External low-speed oscillator ready **/
#define RCC_BDCR_LSERDY		(1 << 1)
/** RCC_BDCR_LSEON External low-speed oscillator enable **/
#define RCC_BDCR_LSEON		(1 << 0)

/**@}*/

/** @defgroup rcc_csr CSR clock control & status register
@{*/

/** RCC_CSR_LPWRRSTF Low-power reset flag **/
#define RCC_CSR_LPWRRSTF		(1 << 31)
/** RCC_CSR_WWDGRSTF Window watchdog reset flag **/
#define RCC_CSR_WWDGRSTF		(1 << 30)
/** RCC_CSR_WDGRSTF Independent watchdog reset flag **/
#define RCC_CSR_WDGRSTF		(1 << 29)
/** RCC_CSR_SFTRSTF Software reset flag **/
#define RCC_CSR_SFTRSTF		(1 << 28)
/** RCC_CSR_PORRSTF POR/PDR reset flag **/
#define RCC_CSR_PORRSTF		(1 << 27)
/** RCC_CSR_PADRSTF PIN reset flag **/
#define RCC_CSR_PADRSTF		(1 << 26)
/** RCC_CSR_BORRSTF BOR reset flag **/
#define RCC_CSR_BORRSTF		(1 << 25)
/** RCC_CSR_RMVF Remove reset flag **/
#define RCC_CSR_RMVF		(1 << 24)
/** RCC_CSR_LSIRDY Internal low-speed oscillator ready **/
#define RCC_CSR_LSIRDY		(1 << 1)
/** RCC_CSR_LSION Internal low-speed oscillator enable **/
#define RCC_CSR_LSION		(1 << 0)

/**@}*/

/** @defgroup rcc_sscgr SSCGR spread spectrum clock generation register
@{*/

/** RCC_SSCGR_SSCGEN Spread spectrum modulation enable **/
#define RCC_SSCGR_SSCGEN		(1 << 31)
/** RCC_SSCGR_SPREADSEL Spread Select **/
#define RCC_SSCGR_SPREADSEL		(1 << 30)

#define RCC_SSCGR_INCSTEP_SHIFT		13
#define RCC_SSCGR_INCSTEP_MASK		0x7fff
/** @defgroup rcc_sscgr_incstep INCSTEP Incrementation step
@{*/
/**@}*/


#define RCC_SSCGR_MODPER_SHIFT		0
#define RCC_SSCGR_MODPER_MASK		0x1fff
/** @defgroup rcc_sscgr_modper MODPER Modulation period
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_plli2scfgr PLLI2SCFGR PLLI2S configuration register
@{*/


#define RCC_PLLI2SCFGR_PLLI2SRx_SHIFT		28
#define RCC_PLLI2SCFGR_PLLI2SRx_MASK		0x07
/** @defgroup rcc_plli2scfgr_plli2srx PLLI2SRx PLLI2S division factor for I2S clocks
@{*/
/**@}*/


#define RCC_PLLI2SCFGR_PLLI2SNx_SHIFT		6
#define RCC_PLLI2SCFGR_PLLI2SNx_MASK		0x1ff
/** @defgroup rcc_plli2scfgr_plli2snx PLLI2SNx PLLI2S multiplication factor for VCO
@{*/
/**@}*/


/**@}*/
